In [2]:
import numpy as np
import pandas as pd

# Link

https://data.boston.gov/dataset/community-centers1/resource/f793c76f-145c-4755-9f07-7b73ac2d724b

In [3]:
df = pd.read_csv('data/Community_Centers.csv')

In [6]:
df.head()

           X          Y
0 -71.010827  42.388882
1 -71.036892  42.372427
2 -71.037522  42.372882
3 -71.069917  42.379769
4 -71.060951  42.380995

In [5]:
df = df[['X','Y']]

In [7]:
df.head()

           X          Y
0 -71.010827  42.388882
1 -71.036892  42.372427
2 -71.037522  42.372882
3 -71.069917  42.379769
4 -71.060951  42.380995